In [28]:
import numpy as np
import pandas as pd

In [29]:
# 1. Convert the entire sales data into pandas DataFrame and name it data
sales = pd.read_csv('../../Module5/sales_data_sample.csv', encoding='latin')
data = pd.DataFrame(sales)
data

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,ORDERDATE,STATUS,QTR_ID,MONTH_ID,YEAR_ID,...,ADDRESSLINE1,ADDRESSLINE2,CITY,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE
0,10107,30,95.70,2,2871.00,2/24/2003 0:00,Shipped,1,2,2003,...,897 Long Airport Avenue,NaN,NYC,NY,10022,USA,NaN,Yu,Kwai,Small
1,10121,34,81.35,5,2765.90,5/7/2003 0:00,Shipped,2,5,2003,...,59 rue de l'Abbaye,NaN,Reims,NaN,51100,France,EMEA,Henriot,Paul,Small
2,10134,41,94.74,2,3884.34,7/1/2003 0:00,Shipped,3,7,2003,...,27 rue du Colonel Pierre Avia,NaN,Paris,NaN,75508,France,EMEA,Da Cunha,Daniel,Medium
3,10145,45,83.26,6,3746.70,8/25/2003 0:00,Shipped,3,8,2003,...,78934 Hillside Dr.,NaN,Pasadena,CA,90003,USA,NaN,Young,Julie,Medium
4,10159,49,100.00,14,5205.27,10/10/2003 0:00,Shipped,4,10,2003,...,7734 Strong St.,NaN,San Francisco,CA,NaN,USA,NaN,Brown,Julie,Medium
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2818,10350,20,100.00,15,2244.40,12/2/2004 0:00,Shipped,4,12,2004,...,"C/ Moralzarzal, 86",NaN,Madrid,NaN,28034,Spain,EMEA,Freyre,Diego,Small
2819,10373,29,100.00,1,3978.51,1/31/2005 0:00,Shipped,1,1,2005,...,Torikatu 38,NaN,Oulu,NaN,90110,Finland,EMEA,Koskitalo,Pirkko,Medium
2820,10386,43,100.00,4,5417.57,3/1/2005 0:00,Resolved,1,3,2005,...,"C/ Moralzarzal, 86",NaN,Madrid,NaN,28034,Spain,EMEA,Freyre,Diego,Medium
2821,10397,34,62.24,1,2116.16,3/28/2005 0:00,Shipped,1,3,2005,...,1 rue Alsace-Lorraine,NaN,Toulouse,NaN,31000,France,EMEA,Roulet,Annette,Small
2822,10414,47,65.52,9,3079.44,5/6/2005 0:00,On Hold,2,5,2005,...,8616 Spinnaker Dr.,NaN,Boston,MA,51003,USA,NaN,Yoshido,Juri,Medium

In [30]:
# 2. Count the number of ‘USA’ in ‘COUNTRY’ column
dataaux = data[data['COUNTRY'] == 'USA'].count()
dataaux['COUNTRY']

1004

In [31]:
# 3. Delete all the rows whose ‘TERRITORY’ attribute is equal to ‘NaN’

data.dropna(subset=['TERRITORY'])

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,ORDERDATE,STATUS,QTR_ID,MONTH_ID,YEAR_ID,...,ADDRESSLINE1,ADDRESSLINE2,CITY,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE
1,10121,34,81.35,5,2765.90,5/7/2003 0:00,Shipped,2,5,2003,...,59 rue de l'Abbaye,NaN,Reims,NaN,51100,France,EMEA,Henriot,Paul,Small
2,10134,41,94.74,2,3884.34,7/1/2003 0:00,Shipped,3,7,2003,...,27 rue du Colonel Pierre Avia,NaN,Paris,NaN,75508,France,EMEA,Da Cunha,Daniel,Medium
6,10180,29,86.13,9,2497.77,11/11/2003 0:00,Shipped,4,11,2003,...,"184, chausse de Tournai",NaN,Lille,NaN,59000,France,EMEA,Rance,Martine,Small
7,10188,48,100.00,1,5512.32,11/18/2003 0:00,Shipped,4,11,2003,...,"Drammen 121, PR 744 Sentrum",NaN,Bergen,NaN,N 5804,Norway,EMEA,Oeztan,Veysel,Medium
9,10211,41,100.00,14,4708.44,1/15/2004 0:00,Shipped,1,1,2004,...,"25, rue Lauriston",NaN,Paris,NaN,75016,France,EMEA,Perrier,Dominique,Medium
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2816,10327,37,86.74,4,3209.38,11/10/2004 0:00,Resolved,4,11,2004,...,Vinb'ltet 34,NaN,Kobenhavn,NaN,1734,Denmark,EMEA,Petersen,Jytte,Medium
2818,10350,20,100.00,15,2244.40,12/2/2004 0:00,Shipped,4,12,2004,...,"C/ Moralzarzal, 86",NaN,Madrid,NaN,28034,Spain,EMEA,Freyre,Diego,Small
2819,10373,29,100.00,1,3978.51,1/31/2005 0:00,Shipped,1,1,2005,...,Torikatu 38,NaN,Oulu,NaN,90110,Finland,EMEA,Koskitalo,Pirkko,Medium
2820,10386,43,100.00,4,5417.57,3/1/2005 0:00,Resolved,1,3,2005,...,"C/ Moralzarzal, 86",NaN,Madrid,NaN,28034,Spain,EMEA,Freyre,Diego,Medium
2821,10397,34,62.24,1,2116.16,3/28/2005 0:00,Shipped,1,3,2005,...,1 rue Alsace-Lorraine,NaN,Toulouse,NaN,31000,France,EMEA,Roulet,Annette,Small

In [32]:
# 4. Count the number of ‘USA’ in ‘COUNTRY’ column again. Does the number match with that in #2? What happened?


dataaux = data[data['COUNTRY'] == 'USA'].count()
dataaux['COUNTRY']

# Anwser: in my case, the number didnt change. Maybe is because of my solution (using a aux), but overall, I believe that dropna do not extract the rows from the DataFrame, only display it filtered

1004

In [33]:
# 5. In data, filter duplicates based on the ‘ORDERNUMBER’ column using drop_duplicates(). Keep the last row by passing keep=’last’. 

data.drop_duplicates(['ORDERNUMBER'], keep='last')

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,ORDERDATE,STATUS,QTR_ID,MONTH_ID,YEAR_ID,...,ADDRESSLINE1,ADDRESSLINE2,CITY,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE
222,10216,43,100.00,1,5759.42,2/2/2004 0:00,Shipped,1,2,2004,...,"67, avenue de l'Europe",NaN,Versailles,NaN,78000,France,EMEA,Tonini,Daniel,Medium
247,10189,28,100.00,1,4512.48,11/18/2003 0:00,Shipped,4,11,2003,...,78934 Hillside Dr.,NaN,Pasadena,CA,90003,USA,NaN,Young,Julie,Medium
313,10376,35,100.00,1,3987.20,2/8/2005 0:00,Shipped,1,2,2005,...,4097 Douglas Av.,NaN,Glendale,CA,92561,USA,NaN,Young,Leslie,Medium
327,10231,49,100.00,1,6952.12,3/19/2004 0:00,Shipped,1,3,2004,...,"Merchants House, 27-30 Merchant's Quay",NaN,Madrid,NaN,28023,Spain,EMEA,Fernandez,Jesus,Medium
408,10277,28,100.00,1,3127.88,8/4/2004 0:00,Shipped,3,8,2004,...,"Bronz Sok., Bronz Apt. 3/6 Tesvikiye",NaN,Singapore,NaN,79903,Singapore,Japan,Natividad,Eric,Medium
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2818,10350,20,100.00,15,2244.40,12/2/2004 0:00,Shipped,4,12,2004,...,"C/ Moralzarzal, 86",NaN,Madrid,NaN,28034,Spain,EMEA,Freyre,Diego,Small
2819,10373,29,100.00,1,3978.51,1/31/2005 0:00,Shipped,1,1,2005,...,Torikatu 38,NaN,Oulu,NaN,90110,Finland,EMEA,Koskitalo,Pirkko,Medium
2820,10386,43,100.00,4,5417.57,3/1/2005 0:00,Resolved,1,3,2005,...,"C/ Moralzarzal, 86",NaN,Madrid,NaN,28034,Spain,EMEA,Freyre,Diego,Medium
2821,10397,34,62.24,1,2116.16,3/28/2005 0:00,Shipped,1,3,2005,...,1 rue Alsace-Lorraine,NaN,Toulouse,NaN,31000,France,EMEA,Roulet,Annette,Small
2822,10414,47,65.52,9,3079.44,5/6/2005 0:00,On Hold,2,5,2005,...,8616 Spinnaker Dr.,NaN,Boston,MA,51003,USA,NaN,Yoshido,Juri,Medium

In [34]:
# 6. Select all the rows where ‘PRODUCTLINE’ column is equal to ‘Motorcycles’

data[data['PRODUCTLINE'] == 'Motorcycles']

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,ORDERDATE,STATUS,QTR_ID,MONTH_ID,YEAR_ID,...,ADDRESSLINE1,ADDRESSLINE2,CITY,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE
0,10107,30,95.70,2,2871.00,2/24/2003 0:00,Shipped,1,2,2003,...,897 Long Airport Avenue,NaN,NYC,NY,10022,USA,NaN,Yu,Kwai,Small
1,10121,34,81.35,5,2765.90,5/7/2003 0:00,Shipped,2,5,2003,...,59 rue de l'Abbaye,NaN,Reims,NaN,51100,France,EMEA,Henriot,Paul,Small
2,10134,41,94.74,2,3884.34,7/1/2003 0:00,Shipped,3,7,2003,...,27 rue du Colonel Pierre Avia,NaN,Paris,NaN,75508,France,EMEA,Da Cunha,Daniel,Medium
3,10145,45,83.26,6,3746.70,8/25/2003 0:00,Shipped,3,8,2003,...,78934 Hillside Dr.,NaN,Pasadena,CA,90003,USA,NaN,Young,Julie,Medium
4,10159,49,100.00,14,5205.27,10/10/2003 0:00,Shipped,4,10,2003,...,7734 Strong St.,NaN,San Francisco,CA,NaN,USA,NaN,Brown,Julie,Medium
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2452,10356,26,100.00,4,3937.70,12/9/2004 0:00,Shipped,4,12,2004,...,27 rue du Colonel Pierre Avia,NaN,Paris,NaN,75508,France,EMEA,Da Cunha,Daniel,Medium
2453,10365,44,100.00,2,4984.32,1/7/2005 0:00,Shipped,1,1,2005,...,4575 Hillside Dr.,NaN,New Bedford,MA,50553,USA,NaN,Tam,Wing C,Medium
2454,10375,49,100.00,8,5406.66,2/3/2005 0:00,Shipped,1,2,2005,...,"67, rue des Cinquante Otages",NaN,Nantes,NaN,44000,France,EMEA,Labrune,Janine,Medium
2455,10390,22,100.00,13,3491.18,3/4/2005 0:00,Shipped,1,3,2005,...,5677 Strong St.,NaN,San Rafael,CA,97562,USA,NaN,Nelson,Valarie,Medium
2456,10403,31,68.34,3,2118.54,4/8/2005 0:00,Shipped,2,4,2005,...,Berkeley Gardens 12 Brewery,NaN,Liverpool,NaN,WX1 6LT,UK,EMEA,Devon,Elizabeth,Small

In [35]:
# 7. Select the ‘QUANTITYORDERED’ column only and save it as qty

qty = data['QUANTITYORDERED']
type(qty) # Show that qty becomes a Series

pandas.core.series.Series

In [42]:
# 8. Use cut to divide the qty data into four bins of an equal length

pd.cut(qty, 4)

0        (28.75, 51.5]
1        (28.75, 51.5]
2        (28.75, 51.5]
3        (28.75, 51.5]
4        (28.75, 51.5]
             ...
2818    (5.909, 28.75]
2819     (28.75, 51.5]
2820     (28.75, 51.5]
2821     (28.75, 51.5]
2822     (28.75, 51.5]
Name: QUANTITYORDERED, Length: 2823, dtype: category
Categories (4, interval[float64]): [(5.909, 28.75] < (28.75, 51.5] < (51.5, 74.25] < (74.25, 97.0]]

In [43]:
# 9. Use pd.value_counts() to count the number of data points in each bin in #8. It shows the number data points appearing in four bins of an equal length.

index = pd.Index(pd.cut(qty, 4))
index.value_counts()

(28.75, 51.5]     1930
(5.909, 28.75]     843
(51.5, 74.25]       44
(74.25, 97.0]        6
Name: QUANTITYORDERED, dtype: int64

In [44]:
# 10. Use qcut to divide the qty data into four bins pertaining to each quartile.

pd.qcut(qty, 4)

0        (27.0, 35.0]
1        (27.0, 35.0]
2        (35.0, 43.0]
3        (43.0, 97.0]
4        (43.0, 97.0]
            ...
2818    (5.999, 27.0]
2819     (27.0, 35.0]
2820     (35.0, 43.0]
2821     (27.0, 35.0]
2822     (43.0, 97.0]
Name: QUANTITYORDERED, Length: 2823, dtype: category
Categories (4, interval[float64]): [(5.999, 27.0] < (27.0, 35.0] < (35.0, 43.0] < (43.0, 97.0]]

In [45]:
# 11. Use pd.value_counts() to count the number of data points in each bin in #10. (Discretization and Binning in 7.2) (Why aren’t there an equal number of data points in each bin?)

index = pd.Index(pd.qcut(qty, 4))
index.value_counts()

(5.999, 27.0]    761
(27.0, 35.0]     714
(35.0, 43.0]     687
(43.0, 97.0]     661
Name: QUANTITYORDERED, dtype: int64